base_files/cylinder_rot/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    cyclic2
    {
        type    cyclic;
        inGroups    1(cyclic);
        neighbourPatch  cyclic1;
        physicalType    patch;
        nFaces          45972;
        startFace       70794;
    }
    cyclic1
    {
        type    cyclic;
        inGroups    1(cyclic);
        neighbourPatch  cyclic2;
        physicalType    patch;
        nFaces          45972;
        startFace       116766;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          49;
        startFace       162738;
    }
    wall
    {
        type    wall;
        physicalType wall;
        nFaces          598;
        startFace       162787;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          49;
        startFace       163385;
    }
    cylinder
    {
        type            patch;
        physicalType    patch;
        nFaces          156;
        startFace       163434;
    }
)

// ************************************************************************* //
