base_files/cylinder_rot/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5.0;

deltaT          0.001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;



functions
{

    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type        probes;

        // Name of the directory for probe data
        name        probes;

        enabled         true;
        
        writeControl timeStep;
        writeInterval 100;

        // Fields to be probed
        fields (
                p 
                U 
            );

        probeLocations
        (
        (0.06 0.0 0.005)
        (0.06 0.01 0.005)
        (0.06 0.02 0.005)
        (0.06 0.02 0.005)
        (0.05 0.03 0.005)
        (0.05 0.04 0.005)
        (0.04 0.04 0.005)
        (0.04 0.05 0.005)
        (0.03 0.05 0.005)
        (0.02 0.05 0.005)
        (0.02 0.06 0.005)
        (0.01 0.06 0.005)
        (0.0 0.06 0.005)
        (-0.01 0.06 0.005)
        (-0.01 0.06 0.005)
        (-0.02 0.06 0.005)
        (-0.03 0.05 0.005)
        (-0.03 0.05 0.005)
        (-0.04 0.04 0.005)
        (-0.05 0.04 0.005)
        (-0.05 0.03 0.005)
        (-0.05 0.03 0.005)
        (-0.06 0.02 0.005)
        (-0.06 0.01 0.005)
        (-0.06 0.0 0.005)
        (-0.06 -0.0 0.005)
        (-0.06 -0.01 0.005)
        (-0.06 -0.02 0.005)
        (-0.05 -0.03 0.005)
        (-0.05 -0.03 0.005)
        (-0.05 -0.04 0.005)
        (-0.04 -0.04 0.005)
        (-0.03 -0.05 0.005)
        (-0.03 -0.05 0.005)
        (-0.02 -0.06 0.005)
        (-0.01 -0.06 0.005)
        (-0.01 -0.06 0.005)
        (0.0 -0.06 0.005)
        (0.01 -0.06 0.005)
        (0.02 -0.06 0.005)
        (0.02 -0.05 0.005)
        (0.03 -0.05 0.005)
        (0.04 -0.05 0.005)
        (0.04 -0.04 0.005)
        (0.05 -0.04 0.005)
        (0.05 -0.03 0.005)
        (0.06 -0.02 0.005)
        (0.06 -0.02 0.005)
        (0.06 -0.01 0.005)
        (0.06 -0.0 0.005)
        (0.09 0.0 0.005)
        (0.09 0.01 0.005)
        (0.09 0.02 0.005)
        (0.08 0.03 0.005)
        (0.08 0.04 0.005)
        (0.07 0.05 0.005)
        (0.06 0.06 0.005)
        (0.06 0.07 0.005)
        (0.05 0.08 0.005)
        (0.04 0.08 0.005)
        (0.03 0.09 0.005)
        (0.01 0.09 0.005)
        (0.0 0.09 0.005)
        (-0.01 0.09 0.005)
        (-0.02 0.09 0.005)
        (-0.03 0.08 0.005)
        (-0.04 0.08 0.005)
        (-0.05 0.07 0.005)
        (-0.06 0.07 0.005)
        (-0.07 0.06 0.005)
        (-0.08 0.05 0.005)
        (-0.08 0.04 0.005)
        (-0.09 0.03 0.005)
        (-0.09 0.02 0.005)
        (-0.09 0.01 0.005)
        (-0.09 -0.01 0.005)
        (-0.09 -0.02 0.005)
        (-0.09 -0.03 0.005)
        (-0.08 -0.04 0.005)
        (-0.08 -0.05 0.005)
        (-0.07 -0.06 0.005)
        (-0.06 -0.07 0.005)
        (-0.05 -0.07 0.005)
        (-0.04 -0.08 0.005)
        (-0.03 -0.08 0.005)
        (-0.02 -0.09 0.005)
        (-0.01 -0.09 0.005)
        (0.0 -0.09 0.005)
        (0.01 -0.09 0.005)
        (0.03 -0.09 0.005)
        (0.04 -0.08 0.005)
        (0.05 -0.08 0.005)
        (0.06 -0.07 0.005)
        (0.06 -0.06 0.005)
        (0.07 -0.05 0.005)
        (0.08 -0.04 0.005)
        (0.08 -0.03 0.005)
        (0.09 -0.02 0.005)
        (0.09 -0.01 0.005)
        (0.09 -0.0 0.005)
        (0.1 -0.14 0.005)
        (0.12 -0.1 0.005)
        (0.14 -0.06 0.005)
        (0.16 -0.02 0.005)
        (0.18 0.02 0.005)
        (0.22 0.06 0.005)
        (0.25 0.1 0.005)
        (0.29 0.14 0.005)
        (0.34 -0.14 0.005)
        (0.4 -0.1 0.005)
        (0.46 -0.06 0.005)
        (0.54 -0.02 0.005)
        (0.63 0.02 0.005)
        (0.1 0.06 0.005)
        (0.12 0.1 0.005)
        (0.14 0.14 0.005)
        (0.16 -0.14 0.005)
        (0.18 -0.1 0.005)
        (0.22 -0.06 0.005)
        (0.25 -0.02 0.005)
        (0.29 0.02 0.005)
        (0.34 0.06 0.005)
        (0.4 0.1 0.005)
        (0.46 0.14 0.005)
        (0.54 -0.14 0.005)
        (0.63 -0.1 0.005)
        (0.1 -0.06 0.005)
        (0.12 -0.02 0.005)
        (0.14 0.02 0.005)
        (0.16 0.06 0.005)
        (0.18 0.1 0.005)
        (0.22 0.14 0.005)
        (0.25 -0.14 0.005)
        (0.29 -0.1 0.005)
        (0.34 -0.06 0.005)
        (0.4 -0.02 0.005)
        (0.46 0.02 0.005)
        (0.54 0.06 0.005)
        (0.63 0.1 0.005)
        (0.1 0.14 0.005)
        (0.12 -0.14 0.005)
        (0.14 -0.1 0.005)
        (0.16 -0.06 0.005)
        (0.18 -0.02 0.005)
        (0.22 0.02 0.005)
        (0.25 0.06 0.005)
        (0.29 0.1 0.005)
        (0.34 0.14 0.005)
        (0.4 -0.14 0.005)
        (0.46 -0.1 0.005)
        (0.54 -0.06 0.005)
        (0.63 -0.02 0.005)
        (0.1 0.02 0.005)
        (0.12 0.06 0.005)
        (0.14 0.1 0.005)
        (0.16 0.14 0.005)
        (0.18 -0.14 0.005)
        (0.22 -0.1 0.005)
        (0.25 -0.06 0.005)
        (0.29 -0.02 0.005)
        (0.34 0.02 0.005)
        (0.4 0.06 0.005)
        (0.46 0.1 0.005)
        (0.54 0.14 0.005)
        (0.63 -0.14 0.005)
        (0.1 -0.1 0.005)
        (0.12 -0.06 0.005)
        (0.14 -0.02 0.005)
        (0.16 0.02 0.005)
        (0.18 0.06 0.005)
        (0.22 0.1 0.005)
        (0.25 0.14 0.005)
        (0.29 -0.14 0.005)
        (0.34 -0.1 0.005)
        (0.4 -0.06 0.005)
        (0.46 -0.02 0.005)
        (0.54 0.02 0.005)
        (0.63 0.06 0.005)
        (0.1 0.1 0.005)
        (0.12 0.14 0.005)
        (0.14 -0.14 0.005)
        (0.16 -0.1 0.005)
        (0.18 -0.06 0.005)
        (0.22 -0.02 0.005)
        (0.25 0.02 0.005)
        (0.29 0.06 0.005)
        (0.34 0.1 0.005)
        (0.4 0.14 0.005)
        (0.46 -0.14 0.005)
        (0.54 -0.1 0.005)
        (0.63 -0.06 0.005)
        (0.1 -0.02 0.005)
        (0.12 0.02 0.005)
        (0.14 0.06 0.005)
        (0.16 0.1 0.005)
        (0.18 0.14 0.005)
        (0.22 -0.14 0.005)
        (0.25 -0.1 0.005)
        (0.29 -0.06 0.005)
        (0.34 -0.02 0.005)
        (0.4 0.02 0.005)
        (0.46 0.06 0.005)
        (0.54 0.1 0.005)
        (0.63 0.14 0.005)
        (0.0 0.1 0.005)
        (0.01 0.1 0.005)
        (0.03 0.1 0.005)
        (0.04 0.1 0.005)
        (0.06 0.1 0.005)
        (0.07 0.1 0.005)
        (0.09 0.1 0.005)
        (0.1 0.1 0.005)
        (0.0 0.14 0.005)
        (0.01 0.14 0.005)
        (0.03 0.14 0.005)
        (0.04 0.14 0.005)
        (0.06 0.14 0.005)
        (0.07 0.14 0.005)
        (0.09 0.14 0.005)
        (0.1 0.14 0.005)
        (0.0 -0.14 0.005)
        (0.01 -0.14 0.005)
        (0.03 -0.14 0.005)
        (0.04 -0.14 0.005)
        (0.06 -0.14 0.005)
        (0.07 -0.14 0.005)
        (0.09 -0.14 0.005)
        (0.1 -0.14 0.005)
        (0.0 -0.1 0.005)
        (0.01 -0.1 0.005)
        (0.03 -0.1 0.005)
        (0.04 -0.1 0.005)
        (0.06 -0.1 0.005)
        (0.07 -0.1 0.005)
        (0.09 -0.1 0.005)
        (0.1 -0.1 0.005)    
        );
    }

    forces_cylinder
    {
        type forces;
        functionObjectLibs ("libforces.so");
        enabled true;
        writeControl timeStep;
        writeInterval 100;
        patches
        (
            cylinder
        );
        log true;
        rho rhoInf;
        rhoInf 1.0;
        CofR (0 0 0);
        liftDir (0 1 0);
        dragDir (1 0 0);
        pitchAxis (0 0 1);
        magUInf 0.9756;
        lRef 0.1;
        Aref 0.001;
    }

    forceCoeffs_cylinder
    {
        type forceCoeffs;
        functionObjectLibs ("libforces.so");
        enabled true;
        writeControl timeStep;
        writeInterval 100;
        patches
        (
            cylinder
        );
        log true;
        rho rhoInf;
        rhoInf 1.0;
        CofR (0 0 0);
        liftDir (0 1 0);
        dragDir (1 0 0);
        pitchAxis (0 0 1);
        magUInf 0.9756;
        lRef 0.1;
        Aref 0.001;
    }
}


// ************************************************************************* //
